MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0516ZAN/mcu.h
 * |[1]     |CRL_IE0   |PWM Group Channel 0 Rising Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable rising latch interrupt
 * |        |          |0 = Disable rising latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 0 has rising transition, Capture
 * |        |          |issues an Interrupt.
 * |[2]     |CFL_IE0   |PWM Group Channel 0 Falling Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable falling latch interrupt
 * |        |          |0 = Disable falling latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 0 has falling transition, Capture
 * |        |          |issues an Interrupt.
 * |[3]     |CAPCH0EN  |Capture Channel 0 transition Enable/Disable
 * |        |          |1 = Enable capture function on PWM group channel 0.
 * |        |          |0 = Disable capture function on PWM group channel 0
 * |        |          |When Enable, Capture latched the PWM-counter value and saved to CRLR (Rising latch)
 * |        |          |and CFLR (Falling latch).
 * |        |          |When Disable, Capture does not update CRLR and CFLR, and disable PWM group
 * |        |          |channel 0 Interrupt.
 * |[4]     |CAPIF0    |Capture0 Interrupt Indication Flag
 * |        |          |If PWM group channel 0 rising latch interrupt is enabled (CRL_IE0=1), a rising transition occurs
 * |        |          |at PWM group channel 0 will result in CAPIF0 to high; Similarly, a falling transition will cause
 * |        |          |CAPIF0 to be set high if PWM group channel 0 falling latch interrupt is enabled (CFL_IE0=1).
 * |        |          |This flag is clear by software with a write 1 to itself.
 * |[6]     |CRLRI0    |CRLR0 Latched Indicator Bit
 * |        |          |When PWM group input channel 0 has a rising transition, CRLR0 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * |[7]     |CFLRI0    |CFLR0 Latched Indicator Bit
 * |        |          |When PWM group input channel 0 has a falling transition, CFLR0 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * |[16]    |INV1      |PWM Group Channel 1 Inverter ON/OFF
 * |        |          |1 = Inverter ON. Reverse the input signal from GPIO before fed to Capture timer
 * |        |          |0 = Inverter OFF
 * |[17]    |CRL_IE1   |PWM Group Channel 1 Rising Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable rising latch interrupt
 * |        |          |0 = Disable rising latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 1 has rising transition, Capture
 * |        |          |issues an Interrupt.
 * |[18]    |CFL_IE1   |PWM Group Channel 1 Falling Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable falling latch interrupt
 * |        |          |0 = Disable falling latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 1 has falling transition, Capture
 * |        |          |issues an Interrupt.
 * |[19]    |CAPCH1EN  |Capture Channel 1 transition Enable/Disable
 * |        |          |1 = Enable capture function on PWM group channel 1.
 * |        |          |0 = Disable capture function on PWM group channel 1
 * |        |          |When Enable, Capture latched the PWM-counter value and saved to CRLR (Rising
 * |        |          |latch) and CFLR (Falling latch).
 * |        |          |When Disable, Capture does not update CRLR and CFLR, and disable PWM group
 * |        |          |channel 1 Interrupt.
 * |[20]    |CAPIF1    |Capture1 Interrupt Indication Flag
 * |        |          |If PWM group channel 1 rising latch interrupt is enabled (CRL_IE1=1), a rising transition occurs
 * |        |          |at PWM group channel 1 will result in CAPIF1 to high; Similarly, a falling transition will cause
 * |        |          |CAPIF1 to be set high if PWM group channel 1 falling latch interrupt is enabled (CFL_IE1=1).
 * |        |          |This flag is clear by software with a write 1 to itself.
 * |[22]    |CRLRI1    |CRLR1 Latched Indicator Bit
 * |        |          |When PWM group input channel 1 has a rising transition, CRLR1 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * |[23]    |CFLRI1    |CFLR1 Latched Indicator Bit
 * |        |          |When PWM group input channel 1 has a falling transition, CFLR1 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * @var PWM_T::CCR2
 * Offset: 0x54  Capture 2/3 Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |INV2      |PWM Group Channel 2 Inverter ON/OFF
 * |        |          |1 = Inverter ON. Reverse the input signal from GPIO before fed to Capture timer
 * |        |          |0 = Inverter OFF
 * |[1]     |CRL_IE2   |PWM Group Channel 2 Rising Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable rising latch interrupt
 * |        |          |0 = Disable rising latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 2 has rising transition, Capture
 * |        |          |issues an Interrupt.
 * |[2]     |CFL_IE2   |PWM Group Channel 2 Falling Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable falling latch interrupt
 * |        |          |0 = Disable falling latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 2 has falling transition, Capture
 * |        |          |issues an Interrupt.
 * |[3]     |CAPCH2EN  |Capture Channel 2 transition Enable/Disable
 * |        |          |1 = Enable capture function on PWM group channel 2.
 * |        |          |0 = Disable capture function on PWM group channel 2
 * |        |          |When Enable, Capture latched the PWM-counter value and saved to CRLR (Rising
 * |        |          |latch) and CFLR (Falling latch).
 * |        |          |When Disable, Capture does not update CRLR and CFLR, and disable PWM group
 * |        |          |channel 2 Interrupt.
 * |[4]     |CAPIF2    |Capture2 Interrupt Indication Flag
 * |        |          |If PWM group channel 2 rising latch interrupt is enabled (CRL_IE2=1), a rising transition occurs
 * |        |          |at PWM group channel 2 will result in CAPIF2 to high; Similarly, a falling transition will cause
 * |        |          |CAPIF2 to be set high if PWM group channel 2 falling latch interrupt is enabled (CFL_IE2=1).
 * |        |          |This flag is clear by software with a write 1 to itself.
 * |[6]     |CRLRI2    |CRLR2 Latched Indicator Bit
 * |        |          |When PWM group input channel 2 has a rising transition, CRLR2 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * |[7]     |CFLRI2    |CFLR2 Latched Indicator Bit
 * |        |          |When PWM group input channel 2 has a falling transition, CFLR2 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * |[16]    |INV3      |PWM Group Channel 3 Inverter ON/OFF
 * |        |          |1 = Inverter ON. Reverse the input signal from GPIO before fed to Capture timer
 * |        |          |0 = Inverter OFF
 * |[17]    |CRL_IE3   |PWM Group Channel 3 Rising Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable rising latch interrupt
 * |        |          |0 = Disable rising latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 3 has rising transition, Capture
 * |        |          |issues an Interrupt.
 * |[18]    |CFL_IE3   |PWM Group Channel 3 Falling Latch Interrupt Enable ON/OFF
 * |        |          |1 = Enable falling latch interrupt
 * |        |          |0 = Disable falling latch interrupt
 * |        |          |When Enable, if Capture detects PWM group channel 3 has falling transition, Capture
 * |        |          |issues an Interrupt.
 * |[19]    |CAPCH3EN  |Capture Channel 3 transition Enable/Disable
 * |        |          |1 = Enable capture function on PWM group channel 3.
 * |        |          |0 = Disable capture function on PWM group channel 3
 * |        |          |When Enable, Capture latched the PWM-counter value and saved to CRLR (Rising
 * |        |          |latch) and CFLR (Falling latch).
 * |        |          |When Disable, Capture does not update CRLR and CFLR, and disable PWM group
 * |        |          |channel 3 Interrupt.
 * |[20]    |CAPIF3    |Capture3 Interrupt Indication Flag
 * |        |          |If PWM group channel 3 rising latch interrupt is enabled (CRL_IE3=1), a rising transition occurs
 * |        |          |at PWM group channel 3 will result in CAPIF3 to high; Similarly, a falling transition will cause
 * |        |          |CAPIF3 to be set high if PWM group channel 3 falling latch interrupt is enabled (CFL_IE3=1).
 * |        |          |This flag is clear by software with a write 1 to itself.
 * |[22]    |CRLRI3    |CRLR3 Latched Indicator Bit
 * |        |          |When PWM group input channel 3 has a rising transition, CRLR3 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * |[23]    |CFLRI3    |CFLR3 Latched Indicator Bit
 * |        |          |When PWM group input channel 3 has a falling transition, CFLR3 was latched with the value of
 * |        |          |PWM down-counter and this bit is set by hardware.
 * |        |          |Clear this bit by writing a one to it.
 * @var PWM_T::CRLR0
 * Offset: 0x58  Capture 0 Rising Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter when Channel 0/1/2/3 has rising transition.
 * @var PWM_T::CFLR0
 * Offset: 0x5C  Capture 0 Falling Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter when Channel 01/2/3 has Falling transition.
 * @var PWM_T::CRLR1
 * Offset: 0x60  Capture 1 Rising Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter when Channel 0/1/2/3 has rising transition.
 * @var PWM_T::CFLR1
 * Offset: 0x64  Capture 1 Falling Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter when Channel 01/2/3 has Falling transition.
 * @var PWM_T::CRLR2
 * Offset: 0x68  Capture 2 Rising Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter when Channel 0/1/2/3 has rising transition.
 * @var PWM_T::CFLR2
 * Offset: 0x6C  Capture 2 Falling Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter when Channel 0/1/2/3 has Falling transition.
 * @var PWM_T::CRLR3
 * Offset: 0x70  Capture 3 Rising Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter when Channel 0/1/2/3 has rising transition.
 * @var PWM_T::CFLR3
 * Offset: 0x74  Capture 3 Falling Latch Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter when Channel 0/1/2/3 has Falling transition.
 * @var PWM_T::CAPENR
 * Offset: 0x78  Capture Input Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |CAPENR    |Capture Input Enable Register
 * |        |          |There are four capture inputs from pad. Bit0~Bit3 are used to control each inputs ON or
 * |        |          |OFF.
 * |        |          |0 = OFF (PWMx multi-function pin input does not affect input capture function.)
 * |        |          |1 = (PWMx multi-function pin input will affect its input capture function.)
 * |        |          |CAPENR
 * |        |          |Bit 3210 for PWM group A
 * |        |          |Bit xxx1 -> Capture channel 0 is from P2 [0]
 * |        |          |Bit xx1x -> Capture channel 1 is from P2 [1]
 * |        |          |Bit x1xx -> Capture channel 2 is from P2 [2]
 * |        |          |Bit 1xxx -> Capture channel 3 is from P2 [3]
 * |        |          |Bit 3210 for PWM group B
 * |        |          |Bit xxx1 -> Capture channel 0 is from P2 [4]
 * |        |          |Bit xx1x -> Capture channel 1 is from P2 [5]
 * |        |          |Bit x1xx -> Capture channel 2 is from P2 [6]
 * |        |          |Bit 1xxx -> Capture channel 3 is from P2 [7]
 * @var PWM_T::POE
 * Offset: 0x7C  PWM Output Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWM0      |PWM Channel 0 Output Enable Register
 * |        |          |1 = Enable PWM channel 0 output to pin.
 * |        |          |0 = Disable PWM channel 0 output to pin.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * |[1]     |PWM1      |PWM Channel 1 Output Enable Register
 * |        |          |1 = Enable PWM channel 1 output to pin.
 * |        |          |0 = Disable PWM channel 1 output to pin.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * |[2]     |PWM2      |PWM Channel 2 Output Enable Register
 * |        |          |1 = Enable PWM channel 2 output to pin.
 * |        |          |0 = Disable PWM channel 2 output to pin.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * |[3]     |PWM3      |PWM Channel 3 Output Enable Register
 * |        |          |1 = Enable PWM channel 3 output to pin.
 * |        |          |0 = Disable PWM channel 3 output to pin.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * @var PWM_T::TCON
 * Offset: 0x80  PWM Trigger Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWM0PTEN  |Channel 0 PWM Period Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 0 trigger ADC function
 * |        |          |0 = Disable PWM channel 0 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT01PTYPE setting.
 * |        |          |1 = Enable PWM channel 0 output to pin.
 * |        |          |0 = Disable PWM channel 0 output to pin.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * |[1]     |PWM1PTEN  |Channel 1 PWM Period Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 1 trigger ADC function
 * |        |          |0 = Disable PWM channel 1 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT01PTYPE setting.
 * |[2]     |PWM2PTEN  |Channel 2 PWM Period Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 2 trigger ADC function
 * |        |          |0 = Disable PWM channel 2 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT23PTYPE setting.
 * |[3]     |PWM3PTEN  |Channel 3 PWM Period Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 3 trigger ADC function
 * |        |          |0 = Disable PWM channel 3 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT23PTYPE setting.
 * |[8]     |PWM0DTEN  |Channel 0 PWM Duty Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 0 trigger ADC function
 * |        |          |0 = Disable PWM channel 0 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count or down count to match CMR based on INT01DTYPE setting.
 * |[9]     |PWM1DTEN  |Channel 1 PWM Duty Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 1 trigger ADC function
 * |        |          |0 = Disable PWM channel 1 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count or down count to match CMR based on INT01DTYPE setting.
 * |[10]    |PWM2DTEN  |Channel 2 PWM Duty Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 2 trigger ADC function
 * |        |          |0 = Disable PWM channel 2 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count or down count to match CMR based on INT23DTYPE setting.
 * |[11]    |PWM3DTEN  |Channel 3 PWM Duty Trigger ADC Enable Register
 * |        |          |1 = Enable PWM channel 3 trigger ADC function
 * |        |          |0 = Disable PWM channel 3 trigger ADC function
 * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
 * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM counter up count or down count to match CMR based on INT23DTYPE setting.
 * @var PWM_T::TSTATUS
 * Offset: 0x84  PWM Trigger Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWM0TF    |PWM Channel 0 Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM0 trigger ADC condition matched. As this bit is set to 1,
 * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
 * |        |          |Software can write 1 to clear this bit.
 * |[1]     |PWM1TF    |PWM Channel 1 Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM1 trigger ADC condition matched. As this bit is set to 1,
 * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
 * |        |          |Software can write 1 to clear this bit.
 * |[2]     |PWM2TF    |PWM Channel 2 Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM2 trigger ADC condition matched. As this bit is set to 1,
 * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
 * |        |          |Software can write 1 to clear this bit.
 * |[3]     |PWM3TF    |PWM Channel 3 Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM3 trigger ADC condition matched. As this bit is set to 1,
 * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
 * |        |          |Software can write 1 to clear this bit.
 * @var PWM_T::PSCR
 * Offset: 0x98  PWM Synchronous Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8]     |PSSEN1    |PWM1 Synchronous Start Enable
 * |        |          |1 = PWM1 synchronous start enable.
 * |        |          |0 = PWM1 synchronous start disable.
 * |        |          |If this bit is set to 1, PWM-Timer1 will synchronous start with PWM-Timer0 when SW writes 1 to PCR.CH0EN in PWM group A.
 * |[16]    |PSSEN2    |PWM2 Synchronous Start Enable
 * |        |          |1 = PWM2 synchronous start enable.
 * |        |          |0 = PWM2 synchronous start disable.
 * |        |          |If this bit is set to 1, PWM-Timer2 will synchronous start with PWM-Timer0 when SW writes 1 to PCR.CH0EN in PWM group A.
 * |[24]    |PSSEN3    |PWM3 Synchronous Start Enable
 * |        |          |1 = PWM3 synchronous start enable.
