MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0516ZAN/mcu.h
} GCR_INT_T;



/** @addtogroup INT_CONST INT Bit Field Definition
  Constant Definitions for INT Controller
  @{
 */

/* INT IRQSRC Bit Field Definitions */
#define INT_IRQSRC_INT_SRC_Pos                  0                                       /*!< GCR_INT_T::IRQSRC: INT_SRC Position */
#define INT_IRQSRC_INT_SRC_Msk                  (0xFul << INT_IRQSRC_INT_SRC_Pos)       /*!< GCR_INT_T::IRQSRC: INT_SRC Mask */

/* INT NMI_SEL Bit Field Definitions */
#define INT_NMI_SEL_NMI_EN_Pos                  8                                       /*!< GCR_INT_T::NMISEL: NMI_EN Position */
#define INT_NMI_SEL_NMI_EN_Msk                  (1ul << INT_NMI_SEL_NMI_EN_Pos)         /*!< GCR_INT_T::NMISEL: NMI_EN Mask */

#define INT_NMI_SEL_NMI_SEL_Pos                 0                                       /*!< GCR_INT_T::NMISEL: NMI_SEL Position */
#define INT_NMI_SEL_NMI_SEL_Msk                 (0x1Ful << INT_NMI_SEL_NMI_SEL_Pos)     /*!< GCR_INT_T::NMISEL: NMI_SEL Mask */
/**@}*/ /* INT_CONST */
/**@}*/ /* GCR */



/*----------------------------- TIMER Controller -----------------------------*/
/** @addtogroup TIMER TIMER Controller(TIMER)
  Memory Mapped Structure for Timer Controller
  @{
 */

typedef struct
{


/**
 * @var TIMER_T::TCSR
 * Offset: 0x00  Timer Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |PRESCALE  |Pre-scale Counter
 * |        |          |Clock input is divided by PRESCALE+1 before it is fed to the counter. If
 * |        |          |PRESCALE=0, then there is no scaling.
 * |[16]    |TDR_EN    |Data Load Enable
 * |        |          |When TDR_EN is set, TDR (Timer Data Register) will be updated continuously with
 * |        |          |the 24-bit up-timer value as the timer is counting.
 * |        |          |1 = Timer Data Register update enable.
 * |        |          |0 = Timer Data Register update disable.
 * |[25]    |CACT      |Timer Active Status Bit (Read only)
 * |        |          |This bit indicates the up-timer status.
 * |        |          |0 = Timer is not active.
 * |        |          |1 = Timer is active.
 * |[26]    |CRST      |Timer Reset Bit
 * |        |          |Set this bit will reset the 24-bit up-timer, 8-bit pre-scale counter and also force CEN to
 * |        |          |0.
 * |        |          |0 = No effect.
 * |        |          |1 = Reset Timer's 8-bit pre-scale counter, internal 24-bit up-timer and CEN bit.
 * |[28:27] |MODE      |Timer Operating Mode
 * |        |          |00 =
 * |        |          |The timer is operating in the one-shot mode. The associated
 * |        |          |interrupt signal is generated once (if IE is enabled) and CEN is
 * |        |          |automatically cleared by hardware.
 * |        |          |01 =
 * |        |          |The timer is operating in the periodic mode. The associated
 * |        |          |interrupt signal is generated periodically (if IE is enabled).
 * |        |          |10 =
 * |        |          |The timer is operating in the toggle mode. The interrupt signal is
 * |        |          |generated periodically (if IE is enabled). And the associated
 * |        |          |signal (tout) is changing back and forth with 50% duty cycle.
 * |        |          |11 =
 * |        |          |Reserved
 * |[29]    |IE        |Interrupt Enable Bit
 * |        |          |1 = Enable timer Interrupt.
 * |        |          |0 = Disable timer Interrupt.
 * |        |          |If timer interrupt is enabled, the timer asserts its interrupt signal when the associated
 * |        |          |up-timer value is equal to TCMPR.
 * |[30]    |CEN       |Timer Enable Bit
 * |        |          |1 = Starts counting
 * |        |          |0 = Stops/Suspends counting
 * |        |          |Note1: In stop status, and then set CEN to 1 will enables the 24-bit up-timer keeps up
 * |        |          |counting from the last stop counting value.
 * |        |          |Note2: This bit is auto-cleared by hardware in one-shot mode (MODE[28:27]=00)
 * |        |          |when the associated timer interrupt is generated (IE[29]=1).
 * @var TIMER_T::TCMPR
 * Offset: 0x04  Timer Compare Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:0]  |TCMP      |Timer Compared Value
 * |        |          |TCMP is a 24-bit compared register. When the internal 24-bit up-timer counts and its value
 * |        |          |is equal to TCMP value, a Timer Interrupt is requested if the timer interrupt is enabled with
 * |        |          |TCSR.IE[29]=1. The TCMP value defines the timer counting cycle time.
 * |        |          |Time out period = (Period of timer clock input) * (8-bit PRESCALE + 1) * (24-bit TCMP)
 * |        |          |NOTE1: Never write 0x0 or 0x1 in TCMP, or the core will run into unknown state.
 * |        |          |NOTE2: No matter CEN is 0 or 1, whenever software write a new value into this register,
 * |        |          |TIMER will restart counting using this new value and abort previous count.
 * @var TIMER_T::TISR
 * Offset: 0x08  Timer Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TIF       |Timer Interrupt Flag
 * |        |          |This bit indicates the interrupt status of Timer.
 * |        |          |TIF bit is set by hardware when the up counting value of internal 24-bit timer matches the timer
 * |        |          |compared value (TCMP). It is cleared by writing 1 to this bit.
 * @var TIMER_T::TDR
 * Offset: 0x0C  Timer Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:0]  |TDR       |Timer Data Register
 * |        |          |When TCSR.TDR_EN is set to 1, the internal 24-bit up-timer value will be loaded into TDR.
 * |        |          |User can read this register for the up-timer value.
 * @var TIMER_T::TCAP
 * ===================================================================================================
 * Offset: 0x10  Timer Capture Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:0]  |TCAP      |Timer Capture Data Register
 * |        |          |When TEXEN (TEXCON[3]) is set, RSTCAPSEL (TTXCON[4]) is 0, and the transition on the TEX pins associated TEX_EDGE(TEXCON[2:1]) setting is occurred,
 * |        |          |the internal 24-bit up-timer value will be loaded into TCAP. User can read this register for the counter value.
 * @var TIMER_T::TEXCON
 * Offset: 0x14  Timer External Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TX_PHASE  |Timer External Count Phase
 * |        |          |This bit indicates the external count pin phase.
 * |        |          |1 = A rising edge of external count pin will be counted.
 * |        |          |0 = A falling edge of external count pin will be counted.
 * |[2:1]   |TEX_EDGE  |Timer External Pin Edge Detect
 * |        |          |00 = a 1 to 0 transition on TEX will be detected.
 * |        |          |01 = a 0 to 1 transition on TEX will be detected.
 * |        |          |10 = either 1 to 0 or 0 to 1 transition on TEX will be detected.
 * |        |          |11 = Reserved.
 * |[3]     |TEXEN     |Timer External Pin Enable.
 * |        |          |This bit enables the reset/capture function on the TEX pin.
 * |        |          |1 = The transition detected on the TEX pin will result in capture or reset of timer counter.
 * |        |          |0 = The TEX pin will be ignored.
 * |[4]     |RSTCAPSEL |Timer External Reset Counter / Capture mode select
 * |        |          |1 = TEX transition is using as the timer counter reset function.
 * |        |          |0 = TEX transition is using as the timer capture function.
 * |[5]     |TEXIEN    |Timer External interrupt Enable Bit
 * |        |          |1 = Enable timer External Interrupt
 * |        |          |0 = Disable timer External Interrupt
 * |        |          |If timer external interrupt is enabled, the timer asserts its external interrupt signal and sent to NVIC to inform CPU
 * |        |          |when the transition on the TEX pins associated with TEX_EDGE(TEXCON[2:1]) setting is happened.
 * |        |          |For example, while TEXIEN = 1, TEXEN = 1, and TEX_EDGE = 00,
 * |        |          |a 1 to 0 transition on the TEX pin will cause the TEXIF(TEXISR[0]) interrupt flag to be set then the interrupt signal is generated and sent to NVIC to inform CPU.
 * |[6]     |TEXDB     |Timer External Capture pin De-bounce enable bit
 * |        |          |1 = Enable De-bounce
 * |        |          |0 = Disable De-bounce
 * |        |          |If this bit is enabled, the edge of T0EX~T3EX pin is detected with de-bounce circuit.
 * |[7]     |TCDB      |Timer Counter pin De-bounce enable bit
 * |        |          |1 = Enable De-bounce
 * |        |          |0 = Disable De-bounce
 * |        |          |If this bit is enabled, the edge of T0~T3 pin is detected with de-bounce circuit.
 * @var TIMER_T::TEXISR
 * Offset: 0x18  Timer External Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TEXIF     |Timer External Interrupt Flag
 * |        |          |This bit indicates the external interrupt status of Timer.
 * |        |          |This bit is set by hardware when TEXEN (TEXCON[3]) is to 1,and the transition on the TEX pins associated TEX_EDGE(TEXCON[2:1]) setting is occurred.
 * |        |          |It is cleared by writing 1 to this bit.
 * |        |          |For example, while TEXEN = 1, and TEX_EDGE = 00, a 1 to 0 transition on the TEX pin will cause the TEXIF to be set.
 */

    __IO uint32_t TCSR;          /* Offset: 0x00  Timer Control Register                                             */
    __IO uint32_t TCMPR;         /* Offset: 0x04  Timer Compare Register                                             */
    __IO uint32_t TISR;          /* Offset: 0x08  Timer Interrupt Status Register                                    */
    __IO uint32_t TDR;           /* Offset: 0x0C  Timer Data Register                                                */
    __IO uint32_t TCAP;          /* Offset: 0x10  Timer Capture Data Register                                        */
    __IO uint32_t TEXCON;        /* Offset: 0x14  Timer External Control Register                                    */
    __IO uint32_t TEXISR;        /* Offset: 0x18  Timer External Interrupt Status Register                           */

